/*
Navicat MySQL Data Transfer

Source Server         : localhost
Source Server Version : 50715
Source Host           : localhost:3306
Source Database       : blog

Target Server Type    : MYSQL
Target Server Version : 50715
File Encoding         : 65001

Date: 2018-01-18 16:43:00
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `blog_post`
-- ----------------------------
DROP TABLE IF EXISTS `blog_post`;
CREATE TABLE `blog_post` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(70) NOT NULL,
  `body` longtext NOT NULL,
  `created_time` datetime(6) NOT NULL,
  `modified_time` datetime(6) NOT NULL,
  `excerpt` varchar(200) NOT NULL,
  `author_id` int(11) NOT NULL,
  `category_id` int(11) NOT NULL,
  `views` int(10) unsigned NOT NULL,
  PRIMARY KEY (`id`),
  KEY `blog_post_author_id_dd7a8485_fk_auth_user_id` (`author_id`),
  KEY `blog_post_category_id_c326dbf8_fk_blog_category_id` (`category_id`),
  CONSTRAINT `blog_post_author_id_dd7a8485_fk_auth_user_id` FOREIGN KEY (`author_id`) REFERENCES `auth_user` (`id`),
  CONSTRAINT `blog_post_category_id_c326dbf8_fk_blog_category_id` FOREIGN KEY (`category_id`) REFERENCES `blog_category` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=52 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of blog_post
-- ----------------------------
INSERT INTO `blog_post` VALUES ('1', 'title test', 'body test', '2018-02-15 03:07:29.172618', '2018-01-15 03:07:29.172618', '', '1', '2', '11');
INSERT INTO `blog_post` VALUES ('2', '测试文章', '测试文章内容。\r\n测试文章内容。测试文章内容。测试文章内容。测试文章内容。\r\n测试文章内容。测试文章内容。\r\nv测试文章内容。\r\n测试文章内容。\r\n测试文章内容。测试文章内容。\r\n测试文章内容。测试文章内容。测试文章内容。\r\n测试文章内容。测试文章内容。', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:58.000000', '测试文章摘要', '1', '1', '2');
INSERT INTO `blog_post` VALUES ('3', 'markdown文章', '# 一级标题\r\n\r\n## 二级标题\r\n\r\n### 三级标题\r\n\r\n- 列表1\r\n- 列表2\r\n- 列表3\r\n\r\n> 这是一段引用\r\n~~~python\r\ndef index(request):\r\n    post_list = Post.objects.all().order_by(\'-created_time\')\r\n    return render(request, \'blog/index.html\',\r\ncontext={\'post_list\': post_list})\r\n~~~', '2017-01-16 02:32:54.000000', '2018-01-16 02:32:55.000000', 'Markdown语法测试', '1', '2', '0');
INSERT INTO `blog_post` VALUES ('4', '分页测试1', '分页测试1', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('5', '分页测试2', '分页测试2', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '2', '0');
INSERT INTO `blog_post` VALUES ('6', '分页测试3', '分页测试3', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('7', '分页测试4', '分页测试4', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '2', '0');
INSERT INTO `blog_post` VALUES ('8', '分页测试5', '分页测试5', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('9', '分页测试6', '分页测试6', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '2', '0');
INSERT INTO `blog_post` VALUES ('10', '分页测试7', '分页测试7', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('11', '分页测试8', '分页测试8', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '2', '0');
INSERT INTO `blog_post` VALUES ('12', '分页测试9', '分页测试9', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('13', '分页测试10', '分页测试10', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '2', '17');
INSERT INTO `blog_post` VALUES ('14', '分页测试11', '分页测试11', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('15', '分页测试12', '分页测试12', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '2', '0');
INSERT INTO `blog_post` VALUES ('16', '分页测试13', '分页测试13', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('17', '分页测试14', '分页测试14', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '2', '0');
INSERT INTO `blog_post` VALUES ('18', '分页测试15', '分页测试15', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('19', '分页测试16', '分页测试16', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '2', '0');
INSERT INTO `blog_post` VALUES ('20', '分页测试17', '分页测试17', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('21', '分页测试18', '分页测试18', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '2', '0');
INSERT INTO `blog_post` VALUES ('22', '分页测试19', '分页测试19', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('23', '分页测试20', '分页测试20', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '2', '0');
INSERT INTO `blog_post` VALUES ('24', '分页测试21', '分页测试21', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('25', '分页测试22', '分页测试22', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '2', '0');
INSERT INTO `blog_post` VALUES ('26', '分页测试23', '分页测试23', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('27', '分页测试24', '分页测试24', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '2', '0');
INSERT INTO `blog_post` VALUES ('28', '分页测试25', '分页测试25', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('29', '分页测试26', '分页测试26', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '2', '0');
INSERT INTO `blog_post` VALUES ('30', '分页测试27', '分页测试27', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('31', '分页测试28', '分页测试28', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '2', '0');
INSERT INTO `blog_post` VALUES ('32', '分页测试29', '分页测试29', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('33', '分页测试30', '分页测试30', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '2', '0');
INSERT INTO `blog_post` VALUES ('34', '分页测试31', '分页测试31', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('35', '分页测试32', '分页测试32', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '2', '0');
INSERT INTO `blog_post` VALUES ('36', '分页测试33', '分页测试33', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('37', '分页测试34', '分页测试34', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '2', '0');
INSERT INTO `blog_post` VALUES ('38', '分页测试35', '分页测试35', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('39', '分页测试36', '分页测试36', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '测试摘要', '1', '2', '0');
INSERT INTO `blog_post` VALUES ('40', 'rss', 'rss', '2018-01-18 15:16:09.000000', '2018-01-18 15:16:10.000000', 'rss', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('41', '目录测试', '## 我是标题一\r\n\r\n## 我是标题二\r\n\r\n### 我是标题二下的子标题\r\n\r\n## 我是标题三', '2018-01-18 15:30:44.000000', '2018-01-18 15:30:45.000000', '标题测试', '1', '1', '11');
INSERT INTO `blog_post` VALUES ('42', '测试博客', '本Demo采用FreeMarker 作为视图文件，您还可以使用Jsp、Velocity或自定义类型视图', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('43', '测试博客', '本Demo采用FreeMarker 作为视图文件，您还可以使用Jsp、Velocity或自定义类型视图', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('44', '测试博客', '本Demo采用FreeMarker 作为视图文件，您还可以使用Jsp、Velocity或自定义类型视图', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('45', '测试博客', '本Demo采用FreeMarker 作为视图文件，您还可以使用Jsp、Velocity或自定义类型视图', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('46', '测试博客', '本Demo采用FreeMarker 作为视图文件，您还可以使用Jsp、Velocity或自定义类型视图', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('47', '测试博客', '本Demo采用FreeMarker 作为视图文件，您还可以使用Jsp、Velocity或自定义类型视图', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('48', '测试博客', '本Demo采用FreeMarker 作为视图文件，您还可以使用Jsp、Velocity或自定义类型视图', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('49', '测试博客', '本Demo采用FreeMarker 作为视图文件，您还可以使用Jsp、Velocity或自定义类型视图', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('50', '测试博客', '本Demo采用FreeMarker 作为视图文件，您还可以使用Jsp、Velocity或自定义类型视图', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '摘要', '1', '1', '0');
INSERT INTO `blog_post` VALUES ('51', '测试博客', '本Demo采用FreeMarker 作为视图文件，您还可以使用Jsp、Velocity或自定义类型视图', '2018-01-15 08:15:56.000000', '2018-01-15 08:15:56.000000', '摘要', '1', '1', '0');
